taboadaa/ShuQi/nRF/Packages/.cache/Keil.LPC4300_DFP.2.7.0.pdsc
          <control if="resetVecBankB &gt;= 0x20000000" info="Enable reset vector catch">
            <block>
              // Enable Reset Vector Catch in DEMCR
              Write32(0xE000EDFC, (Read32(0xE000EDFC) | 0x00000001));
            </block>
          </control>
        </sequence>
        <!-- End: ResetCatchSet Sequence for Cortex-M4  -->

        <!-- Begin: ResetCatchClear Sequence for Cortex-M4 -->
        <sequence name="ResetCatchClear" Pname="Cortex-M4">
          <block>
            // Clear FPB Comparators 0 and 1
            Write32(0xE0002008, 0x00000000);
            Write32(0xE000200C, 0x00000000);

            // Disable FPB
            Write32(0xE0002000, 0x00000002);

            // Clear Reset Vector Catch
            Write32(0xE000EDFC, Read32(0xE000EDFC) &amp; (~0x00000001));
          </block>
        </sequence>
        <!-- End: ResetCatchClear Sequence for Cortex-M4 -->


        <!-- Begin: ResetCatchSet Sequence for Cortex-M0 -->
        <sequence name="ResetCatchSet" Pname="Cortex-M0">
          <block>
            __var DHCSR_Addr = 0xE000EDF0;
            __var DEMCR_Addr = 0xE000EDFC;
            __var value      = 0;

            // Enable Reset Vector Catch in DEMCR
            value = Read32(DEMCR_Addr);
            Write32(DEMCR_Addr, (value | 0x00000001));

            // Read DHCSR to clear potentially set DHCSR.S_RESET_ST bit
            Read32(DHCSR_Addr);
          </block>
        </sequence>
        <!-- End: ResetCatchSet Sequence for Cortex-M0 -->

        <!-- Begin: ResetCatchClear Sequence for Cortex-M0 -->
        <sequence name="ResetCatchClear" Pname="Cortex-M0">
          <block>
            __var DEMCR_Addr = 0xE000EDFC;
            __var value      = 0;

            // Disable Reset Vector Catch in DEMCR
            value = Read32(DEMCR_Addr);
            Write32(DEMCR_Addr, (value &amp; (~0x00000001)));
          </block>
        </sequence>
        <!-- End: ResetCatchClear Sequence for Cortex-M0 -->



       <!-- Begin: Pre-defined TraceStart Sequence -->
        <sequence name="TraceStart">
          <block>
            // Nothing required for SWO Trace
            __var traceTPIU   = (__traceout &amp; 0x2) != 0;
            __var traceBuffer = (__traceout &amp; 0x4) != 0;
          </block>

          <control if="traceTPIU">
            <block>
              Sequence("EnableTraceTPIU");
            </block>
          </control>

          <control if="traceBuffer">
            <block>
              Sequence("EnableTraceBuffer");
            </block>
          </control>

        </sequence>
        <!-- End: Pre-defined TraceStart Sequence -->

        <!-- Begin: Pre-defined TraceStop Sequence -->
        <sequence name="TraceStop">
          <block>
            // Nothing required for SWO Trace
            __var traceTPIU   = (__traceout &amp; 0x2) != 0;
            __var traceBuffer = (__traceout &amp; 0x4) != 0;
          </block>

          <control if="traceTPIU">
            <block>
              Sequence("DisableTraceTPIU");
            </block>
          </control>

          <control if="traceBuffer">
            <block>
              Sequence("DisableTraceBuffer");
            </block>
          </control>

        </sequence>
        <!-- End: Pre-defined TraceStop Sequence -->


        <!-- User-defined Debug Access Sequences -->

        <!-- Begin: User-defined EnableTraceTPIU Sequence -->
        <sequence name="EnableTraceTPIU">
          <block>
            __var tracePortWidth = (__traceout &amp; 0x003F0000) &gt;&gt; 16;

            // Setup fixed TRACECLK pin
            Write32(0x40086790, 0x000000B2); // LPC_SCU->SFSPF_4 : Func 2, EPD 0, EPUN 1, EHS 1, EZI 0, ZIF 1
          </block>

          <!-- TRACEDATA[0]-->
          <control if="(RoutingTPIU &amp; 0x1) == 0">
            <!-- TRACEDATA[0]: PF_5 -->
            <block>
              Write32(0x40086794, 0x000000B3); // LPC_SCU->SFSPF_5 : Func 3, EPD 0, EPUN 1, EHS 1, EZI 0, ZIF 1
            </block>
          </control>
          <control if="(RoutingTPIU &amp; 0x1)">
            <!-- TRACEDATA[0]: P7_4 -->
            <block>
              Write32(0x40086390, 0x000000B5); // LPC_SCU->SFSP7_4 : Func 5, EPD 0, EPUN 1, EHS 1, EZI 0, ZIF 1
            </block>
          </control>


          <control if="tracePortWidth &gt;= 2">
            <!-- TRACEDATA[1]-->
            <control if="(RoutingTPIU &amp; 0x1) == 0">
              <!-- TRACEDATA[1]: PF_6 -->
              <block>
                Write32(0x40086798, 0x000000B3); // LPC_SCU->SFSPF_6 : Func 3, EPD 0, EPUN 1, EHS 1, EZI 0, ZIF 1
              </block>
            </control>
            <control if="(RoutingTPIU &amp; 0x1)">
              <!-- TRACEDATA[1]: P7_5 -->
              <block>
                Write32(0x40086394, 0x000000B5); // LPC_SCU->SFSP7_5 : Func 5, EPD 0, EPUN 1, EHS 1, EZI 0, ZIF 1
              </block>
            </control>
          </control>

          <control if="tracePortWidth &gt;= 4">
            <!-- TRACEDATA[2]-->
            <control if="(RoutingTPIU &amp; 0x1) == 0">
              <!-- TRACEDATA[2]: PF_7 -->
              <block>
                Write32(0x4008679C, 0x000000B3); // LPC_SCU->SFSPF_7 : Func 3, EPD 0, EPUN 1, EHS 1, EZI 0, ZIF 1
              </block>
            </control>
            <control if="(RoutingTPIU &amp; 0x1)">
              <!-- TRACEDATA[2]: P7_6 -->
              <block>
                Write32(0x40086398, 0x000000B5); // LPC_SCU->SFSP7_6 : Func 5, EPD 0, EPUN 1, EHS 1, EZI 0, ZIF 1
              </block>
            </control>

            <!-- TRACEDATA[3]-->
            <control if="(RoutingTPIU &amp; 0x1) == 0">
              <!-- TRACEDATA[3]: PF_8 -->
              <block>
                Write32(0x400867A0, 0x000000B3); // LPC_SCU->SFSPF_8 : Func 3, EPD 0, EPUN 1, EHS 1, EZI 0, ZIF 1
              </block>
            </control>
            <control if="(RoutingTPIU &amp; 0x1)">
              <!-- TRACEDATA[3]: P7_7 -->
              <block>
                Write32(0x4008639C, 0x000000B5); // LPC_SCU->SFSP7_7 : Func 5, EPD 0, EPUN 1, EHS 1, EZI 0, ZIF 1
              </block>
            </control>
          </control>
        </sequence>
        <!-- End: User-defined EnableTraceTPIU Sequence -->

