taboadaa/ShuQi/nRF/Packages/.cache/Keil.LPC4300_DFP.2.7.0.pdsc
          <book name="Documents/LPC435X_3X_2X_1X.pdf" title="LPC435x/3x/2x/1x Data Sheet"/>
        </device>

        <!-- *************************  Device 'LPC4315'  ***************************** -->
        <device Dname="LPC4315">
          <memory id="IROM1"                      start="0x1A000000"  size="0x60000"    startup="1"   default="1"/>
          <memory id="IROM2"                      start="0x1B000000"  size="0x60000"    startup="0"   default="1"/>
          <memory id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
          <memory id="IRAM2"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm name="Flash/LPC18xx43xx_384_BA.FLM" start="0x1A000000" size="0x60000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <algorithm name="Flash/LPC18xx43xx_384_BB.FLM" start="0x1B000000" size="0x60000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <environment name="uv">
            <postBuild1>$K/ARM/BIN/ElfDwT.exe !L BASEADDRESS(0x1A000000)</postBuild1>
            <postRun1> 1 </postRun1>
          </environment>

          <book name="Documents/LPC435X_3X_2X_1X.pdf" title="LPC435x/3x/2x/1x Data Sheet"/>
        </device>

        <!-- *************************  Device 'LPC4317'  ***************************** -->
        <device Dname="LPC4317">
          <memory id="IROM1"                      start="0x1A000000"  size="0x80000"    startup="1"   default="1"/>
          <memory id="IROM2"                      start="0x1B000000"  size="0x80000"    startup="0"   default="1"/>
          <memory id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
          <memory id="IRAM2"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm name="Flash/LPC18xx43xx_512_BA.FLM" start="0x1A000000" size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <algorithm name="Flash/LPC18xx43xx_512_BB.FLM" start="0x1B000000" size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <environment name="uv">
            <postBuild1>$K/ARM/BIN/ElfDwT.exe !L BASEADDRESS(0x1A000000)</postBuild1>
            <postRun1> 1 </postRun1>
          </environment>

          <book name="Documents/LPC435X_3X_2X_1X.pdf" title="LPC435x/3x/2x/1x Data Sheet"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'LPC4320'  **************************** -->
      <subFamily DsubFamily="LPC432x">
        <processor Pname="Cortex-M4" Dfpu="1"/>

        <feature type="USBD"          n="1"/>
        <feature type="SPI"           n="1"/>
        <feature type="MPSerial"      n="1"                           name="SSP"/>
        <feature type="PWM"           n="6"/>

        <!-- *************************  Device 'LPC4320'  ***************************** -->
        <device Dname="LPC4320">
          <memory id="IRAM1"                      start="0x10000000"  size="0x18000"    init   ="0"   default="1"/>
          <memory id="IRAM2"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>

          <book name="Documents/LPC4350_30_20_10.pdf" title="LPC4350/30/20/10 Data Sheet"/>
        </device>

        <!-- *************************  Device 'LPC4322'  ***************************** -->
        <device Dname="LPC4322">
          <memory id="IROM1"                      start="0x1A000000"  size="0x80000"    startup="1"   default="1"/>
          <memory id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
          <memory id="IRAM2"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm name="Flash/LPC18xx43xx_512_BA.FLM" start="0x1A000000" size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <environment name="uv">
            <postBuild1>$K/ARM/BIN/ElfDwT.exe !L BASEADDRESS(0x1A000000)</postBuild1>
            <postRun1> 1 </postRun1>
          </environment>

          <book name="Documents/LPC435X_3X_2X_1X.pdf" title="LPC435x/3x/2x/1x Data Sheet"/>
        </device>

        <!-- *************************  Device 'LPC4323'  ***************************** -->
        <device Dname="LPC4323">
          <memory id="IROM1"                      start="0x1A000000"  size="0x40000"    startup="1"   default="1"/>
          <memory id="IROM2"                      start="0x1B000000"  size="0x40000"    startup="0"   default="1"/>
          <memory id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
          <memory id="IRAM2"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm name="Flash/LPC18xx43xx_256_BA.FLM" start="0x1A000000" size="0x40000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <algorithm name="Flash/LPC18xx43xx_256_BB.FLM" start="0x1B000000" size="0x40000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <environment name="uv">
            <postBuild1>$K/ARM/BIN/ElfDwT.exe !L BASEADDRESS(0x1A000000)</postBuild1>
            <postRun1> 1 </postRun1>
          </environment>

          <book name="Documents/LPC435X_3X_2X_1X.pdf" title="LPC435x/3x/2x/1x Data Sheet"/>
        </device>

        <!-- *************************  Device 'LPC4325'  ***************************** -->
        <device Dname="LPC4325">
          <memory id="IROM1"                      start="0x1A000000"  size="0x60000"    startup="1"   default="1"/>
          <memory id="IROM2"                      start="0x1B000000"  size="0x60000"    startup="0"   default="1"/>
          <memory id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
          <memory id="IRAM2"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm name="Flash/LPC18xx43xx_384_BA.FLM" start="0x1A000000" size="0x60000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <algorithm name="Flash/LPC18xx43xx_384_BB.FLM" start="0x1B000000" size="0x60000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <environment name="uv">
            <postBuild1>$K/ARM/BIN/ElfDwT.exe !L BASEADDRESS(0x1A000000)</postBuild1>
            <postRun1> 1 </postRun1>
          </environment>

