taboadaa/ShuQi/nRF/Packages/.cache/Keil.LPC4300_DFP.2.7.0.pdsc
              // Clear Exception States (safe, Core in reset)
              Write32(0xE000ED0C, 0x05FA0002);

              // Release from reset
              Write32(0x40053100, 0);
            </block>
          </sequence>
          <!-- End: ResetProcessor Sequence for Cortex-M0Sub -->

          <!-- Begin: Pre-defined ResetCatchSet Sequence -->
          <sequence name="ResetCatchSet" Pname="Cortex-M0Sub">
            <block>
              __var resetVecBankA = 0;
              __var resetVecBankB = 0;

              // Clear Reset Vector Catch
              Write32(0xE000EDFC, Read32(0xE000EDFC) &amp; (~0x00000001));

              // Read reset vector from bank A
              resetVecBankA = Read32(0x1A000004);
              // Read reset vector from bank B
              resetVecBankB = Read32(0x1B000004);
            </block>

            <control if="resetVecBankA &lt; 0x20000000">
              <!-- Reset Vector of bank A in HW Breakpoint range-->
              <control if="(resetVecBankA &amp; 0x2) == 0">
                <block>
                  // Even Address
                  Write32(0xE0002008, (resetVecBankA &amp; 0x1FFFFFFC) | 0x40000001); // Write address to FPB Comparator 0
                </block>
              </control>
              <control if="resetVecBankA &amp; 0x2">
                <block>
                  // Odd Address
                  Write32(0xE0002008, (resetVecBankA &amp; 0x1FFFFFFC) | 0x80000001); // Write address to FPB Comparator 0
                </block>
              </control>
            </control>

            <control if="resetVecBankB &lt; 0x20000000">
              <!-- Reset Vector of bank B in HW Breakpoint range-->
              <control if="(resetVecBankB &amp; 0x2) == 0">
                <block>
                  // Even Address
                  Write32(0xE000200C, (resetVecBankB &amp; 0x1FFFFFFC) | 0x40000001); // Write address to FPB Comparator 1
                </block>
              </control>
              <control if="resetVecBankA &amp; 0x2">
                <block>
                  // Odd Address
                  Write32(0xE000200C, (resetVecBankB &amp; 0x1FFFFFFC) | 0x80000001); // Write address to FPB Comparator 1
                </block>
              </control>
            </control>

            <block>
              // Enable FPB
              Write32(0xE0002000, 0x00000003);
            </block>

          </sequence>
          <!-- End: Pre-defined ResetCatchSet Sequence -->

          <!-- Begin: Pre-defined ResetCatchClear Sequence -->
          <sequence name="ResetCatchClear" Pname="Cortex-M0Sub">
            <block>
              // Clear FPB Comparators 0 and 1
              Write32(0xE0002008, 0x00000000);
              Write32(0xE000200C, 0x00000000);

              // Disable FPB
              Write32(0xE0002000, 0x00000002);
            </block>
          </sequence>
          <!-- End: Pre-defined ResetCatchClear Sequence -->

          <!-- Begin: DebugCoreStart Sequence for Cortex-M0Sub -->
          <sequence name="DebugCoreStart" Pname="Cortex-M0Sub">
            <block>
              // Default implementation

              // Enable Core Debug via DHCSR
              Write32(0xE000EDF0, 0xA05F0001);
            </block>

            <control if="ReleaseM0SubOnConnect">
              <block>
                // Release M0 from reset
                Write32(0x40053100, 0x00000000);  // RESET_CTRL0: Clear M0_SUB_RST (Bit 12)
              </block>
            </control>
          </sequence>
          <!-- End: DebugCoreStart Sequence for Cortex-M0Sub  -->
        </sequences>
        <!-- **********************  End Debug Description  **************************** -->

        <!-- *************************  Device 'LPC43S70'  ***************************** -->
        <device Dname="LPC43S70">
          <memory id="IRAM1"                      start="0x10000000"  size="0x20000"    init   ="0"   default="1"/>
          <memory id="IRAM2"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>

          <book name="Documents/LPC43S70.pdf" title="LPC43S70 Data Sheet"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <boards>
    <board vendor="Keil" name="MCB4300" revision="Ver 1.3" salesContact="sales.intl@keil.com" orderForm="http://www.keil.com/product/prices.asp?MCB4300=ON">
      <description>Keil MCB4300 Development Board</description>
      <image small="Images/mcb4300_small.jpg" large="Images/mcb4300_large.jpg"/>
      <book category="overview"  name="http://www.keil.com/mcb4300/" title="MCB4300 Evaluation Board Web Page"/>
      <book category="schematic" name="Documents/mcb4300v1-3-schematics.pdf" title="MCB4300 Schematics"/>
      <book category="manual"    name="Documents/mcb1800.chm" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="LPC4350"/>
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="LPC4357"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" DsubFamily="LPC435x"/>
      <feature type="XTAL"            n="12000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="PWR"             n="8" m="12"       name="External Power Supply"/>
      <feature type="RAM"             n="1"              name="16 MB SDRAM"/>
      <feature type="ROM"             n="1"              name="16 MB NOR Flash"/>
      <feature type="ROM"             n="1"              name="4 MB Quad-SPI Flash"/>
      <feature type="ROM"             n="1"              name="16 kB EEPROM"/>
      <feature type="MemCard"         n="1"              name="microSD Card Holder"/>
      <feature type="USB"             n="1"              name="USB 2.0 High-speed Host/Device/OTG interface (USB host + Micro USB Device/OTG connectors)"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full-speed Host/Device interface (USB host + micro USB Device connectors)"/>
      <feature type="CAN"             n="1"/>
      <feature type="RS232"           n="1"/>
      <feature type="ETH"             n="1"              name="10/100 Ethernet Port"/>
      <feature type="GLCD"            n="1"  m="240.320" name="2.4 inch Color QVGA TFT LCD with resistive touchscreen"/>
      <feature type="Poti"            n="1"              name="Potentiometer for ADC Input"/>
      <feature type="LineIn"          n="2"              name="Audio CODEC with Line-In/Out and Speaker/Microphone"/>
      <feature type="LineOut"         n="2"              name="Audio CODEC with Line-In/Out and Speaker/Microphone"/>
      <feature type="ConnOther"       n="1"              name="On-board Speaker"/>
      <feature type="Button"          n="6"              name="Push-Buttons: 3 x GPIO, Reset, ISP, WAKEUP"/>
      <feature type="LED"             n="8"              name="I/O Port LEDs"/>
      <feature type="CustomFF"        n="124" m="170"/>
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="20-pin Cortex debug + ETM Trace (0.05 inch connector)"/>
    </board>
    <board vendor="NGX" name="LPC4330-Xplorer" revision="v1.0" salesContact="sales@ngxtechnologies.com">
      <description>NGX LPC4330-Xplorer Board Support and Examples</description>
      <image small="Images/LPC4330-Xplorer_small.png" large="Images/LPC4330-Xplorer_large.png"/>
      <book category="overview"  name="http://shop.ngxtechnologies.com/product_info.php?products_id=104" title="LPC4330-Xplorer Web Page"/>
      <book category="setup"  name="Documents/LPC433x_xplorer_QSG.pdf" title="Quick Start Guide"/>
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="LPC4330"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" DsubFamily="LPC433x"/>
      <book category="setup"     name="Documents/NXP_Blinky_Lab.pdf" title="LPC4330 Xplorer: Blinky Lab"/>
      <feature type="XTAL"      n="12000000"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="Batt"      n="1"              name="CR2032 Battery for RTC"/>
      <feature type="Button"    n="2"              name="Push-buttons: User and Reset"/>
      <feature type="USB"       n="1"              name="Full-Speed USB device with USB Standard-B Connector"/>
      <feature type="Proto"     n="4"  m="8"       name="PORT0 Prototyping Area with 2.54 mm pitch"/>
      <feature type="Proto"     n="4"  m="8"       name="PORT1 Prototyping Area with 2.54 mm pitch"/>
      <feature type="Proto"     n="4"  m="3"       name="PORT2 Prototyping Area with 2.54 mm pitch"/>
      <feature type="DIO"       n="76"             name="Digital IOs (shared with Analog IOs)"/>
      <feature type="AIO"       n="24"             name="Analog IOs (shared with Digital IOs)"/>
      <feature type="MemCard"   n="1"              name="Micro SD Card Holder"/>
      <feature type="LED"       n="3"              name="LEDs: two User, one Power LED"/>
      <feature type="ConnOther" n="1"              name="Cortex Debug Interface"/>
      <feature type="CustomFF"  n="100" m="130"/>
      <debugInterface adapter="JTAG/SW"   connector="10 pin Cortex debug (0.05 inch connector)"/>
    </board>
  </boards>

  <conditions>
    <!-- conditions are dependency rules that can apply to a component or an individual file -->
    <condition id="ARM Compiler">
      <description>The ARM Compiler toolchain is required for the respective file or component</description>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="CM0">
      <require Dcore="Cortex-M0"/>
    </condition>

    <condition id="CM4">
      <require Dcore="Cortex-M4"/>
    </condition>

