taboadaa/ShuQi/nRF/Packages/.cache/Keil.LPC4300_DFP.2.7.0.pdsc
  </examples>
  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="LPC4300 CMSIS">
      <!-- Cversion is necessary -->
      <description>System Startup for NXP LPC4300 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_LPC43XX      /* Device Startup for NXP43XX */
      </RTE_Components_h>

      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <file category="header" name="Device/Include/LPC43xx.h"/>
        <!-- startup files -->
        <file category="source" name="Device/Source/ARM/startup_LPC43xx.s"       attr="config" version="1.0.0" condition="CM4 ARM Compiler"/>
        <file category="source" name="Device/Source/ARM/startup_LPC43xx_M0.s"    attr="config" version="1.0.0" condition="CM0APP ARM Compiler"/>
        <file category="source" name="Device/Source/ARM/startup_LPC43xx_M0Sub.s" attr="config" version="1.0.0" condition="CM0SUB ARM Compiler"/>
        <!-- system file -->
        <file category="source" name="Device/Source/system_LPC43xx.c"            attr="config" version="1.0.1" condition="CM4"/>
        <file category="source" name="Device/Source/system_LPC43xx_M0.c"         attr="config" version="1.0.1" condition="CM0"/>
        <!-- device configuration required by drivers at the moment -->
        <file category="header" name="RTE_Driver/Config/RTE_Device.h"            attr="config" version="2.2.1"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SCU" Cversion="1.1" condition="LPC4300 CMSIS">
      <description>SCU driver used by RTE Drivers for LPC4300 Series</description>
      <files>
        <file category="header" name="RTE_Driver/SCU_LPC43xx.h"/>
        <file category="source" name="RTE_Driver/SCU_LPC43xx.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="GPIO" Cversion="1.0" condition="LPC4300 CMSIS">
      <description>GPIO driver used by RTE Drivers for LPC4300 Series</description>
      <files>
        <file category="header" name="RTE_Driver/GPIO_LPC43xx.h"/>
        <file category="source" name="RTE_Driver/GPIO_LPC43xx.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="GPDMA" Cversion="1.5" condition="LPC4300 CMSIS">
      <description>GPDMA driver used by RTE Drivers for LPC4300 Series</description>
      <files>
        <file category="header" name="RTE_Driver/GPDMA_LPC43xx.h"/>
        <file category="source" name="RTE_Driver/GPDMA_LPC43xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="CAN" Capiversion="1.0" Cversion="1.4" condition="LPC4300 CMSIS SCU">
      <description>CAN Driver for LPC4300 series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_CAN0                /* Driver CAN0 */
        #define RTE_Drivers_CAN1                /* Driver CAN1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/CAN_LPC43xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USB Device" Csub="USB0" Capiversion="2.1" Cversion="2.11" condition="LPC4300 CMSIS SCU">
      <description>USB0 Device Driver for the LPC4300 series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/USBD0_LPC43xx.c"/>
        <file category="source" name="RTE_Driver/USB0_LPC43xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USB Device" Csub="USB1" Capiversion="2.1" Cversion="2.8" condition="LPC4300 CMSIS SCU">
      <description>USB1 Device Driver for the LPC4300 series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD1               /* Driver USBD1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/USBD1_LPC43xx.c"/>
        <file category="source" name="RTE_Driver/USB1_LPC43xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USB Host" Csub="USB0" Capiversion="2.0" Cversion="2.5" condition="LPC4300 CMSIS SCU">
      <description>USB0 EHCI Host Driver for the LPC4300 series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBH0               /* Driver USBH0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/USBH0_LPC43xx.c"/>
        <file category="source" name="RTE_Driver/USB0_LPC43xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USB Host" Csub="USB1" Capiversion="2.0" Cversion="2.5" condition="LPC4300 CMSIS SCU">
      <description>USB1 EHCI Host Driver for the LPC4300 series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBH1               /* Driver USBH1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/USBH1_LPC43xx.c"/>
        <file category="source" name="RTE_Driver/USB1_LPC43xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="Ethernet MAC" Capiversion="2.1" Cversion="2.8" condition="LPC4300 CMSIS RTOS SCU">
      <description>Ethernet MAC Driver for LPC4300 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_ETH_MAC0            /* Driver ETH_MAC0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/EMAC_LPC43xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="MCI" Capiversion="2.2" Cversion="2.6" condition="LPC4300 CMSIS SCU">
      <description>MCI Driver for LPC4300 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_MCI0                /* Driver MCI0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/MCI_LPC43xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.2" Cversion="2.6" condition="LPC4300 CMSIS SCU">
      <description>I2C Driver for LPC4300 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_I2C0                /* Driver I2C0 */
        #define RTE_Drivers_I2C1                /* Driver I2C1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/I2C_LPC43xx.c"/>
      </files>
    </component>

